PANDAS OPERATIONS

In [8]:
import pandas as pd

In [9]:
#check pandas version
print(pd.__version__)

0.24.2

Series Create,Manipulate,Querry,Delete

In [10]:
#creating a series from a list
array=["Avatar","The Dark Knight","Kung Fu Hustle"]
list=pd.Series(array)
list

0             Avatar
1    The Dark Knight
2     Kung Fu Hustle
dtype: object

In [11]:
#create random ndarray and change index
import numpy as np
k=np.random.randn(3)
i=['First','Second','Third']
s=pd.Series(k,index=i)
s

First     0.047482
Second    1.172558
Third    -0.515100
dtype: float64

In [12]:
#create series from dictionary
d={'First':"Avengers Endgame",'Second':"Avatar"}
s1=pd.Series(d)
s1

First     Avengers Endgame
Second              Avatar
dtype: object

In [70]:
#modify index of series
list.index=['A','B','C']
list

A             Avatar
B    The Dark Knight
C     Kung Fu Hustle
dtype: object

In [14]:
#slicing
s2=list[:3]
s2

A             Avatar
B    The Dark Knight
C     Kung Fu Hustle
dtype: object

In [15]:
s3=list.append(s1)
s3

A                   Avatar
B          The Dark Knight
C           Kung Fu Hustle
First     Avengers Endgame
Second              Avatar
dtype: object

In [16]:
s3.drop('First')

A                  Avatar
B         The Dark Knight
C          Kung Fu Hustle
Second             Avatar
dtype: object

Create DataFrame

In [24]:
dates=pd.date_range('today',periods=8)
nums=np.random.randn(8,5)
columns=['A1','A2','A3','A4','A5']

df=pd.DataFrame(nums,index=dates,columns=columns)
df

                                  A1        A2        A3        A4        A5
2019-09-08 17:30:08.743942 -0.039119 -1.072947  0.336453 -0.448081 -1.107943
2019-09-09 17:30:08.743942  1.731963  0.175018  0.987756 -1.614862  0.267969
2019-09-10 17:30:08.743942  0.082149  0.619153 -0.380246 -2.066589  0.793770
2019-09-11 17:30:08.743942  1.341348  0.614266  0.193021  0.644742 -0.850122
2019-09-12 17:30:08.743942 -1.066134  0.353811 -1.554685  0.936170  0.176015
2019-09-13 17:30:08.743942  0.078484  0.391164  0.016156  1.409079 -2.619115
2019-09-14 17:30:08.743942 -0.895921 -0.410593  0.016545  1.810890  1.643943
2019-09-15 17:30:08.743942  0.284204  0.594046  1.209400  0.189833  0.454552

In [28]:
#create dtaframe with dictionary array
movies={'Name':["The Avengers","Avengers:Age of Ultron","Avengers:Infinity War","Thor Ragnarok","Avengers Endgame","Black Widow"],
     'Year':[2011,2014,2017,2019,2020,2018],'Priority':["Fourth","Fifth","Second","First","Sixth","Third"],'Watched':['Y','Y','Y','Y','N',"Not Released"]}
cols=[1,2,3,4,5,6]

df1=pd.DataFrame(movies,index=cols)
df1

                     Name  Year Priority       Watched
1            The Avengers  2011   Fourth             Y
2  Avengers:Age of Ultron  2014    Fifth             Y
3   Avengers:Infinity War  2017   Second             Y
4           Thor Ragnarok  2019    First             Y
5        Avengers Endgame  2020    Sixth             N
6             Black Widow  2018    Third  Not Released

In [29]:
#see data types used in dataframe
df1.dtypes

Name        object
Year         int64
Priority    object
Watched     object
dtype: object

In [33]:
print(df1.head(2))
df1.tail(3)

                     Name  Year Priority Watched
1            The Avengers  2011   Fourth       Y
2  Avengers:Age of Ultron  2014    Fifth       Y

               Name  Year Priority       Watched
4     Thor Ragnarok  2019    First             Y
5  Avengers Endgame  2020    Sixth             N
6       Black Widow  2018    Third  Not Released

In [37]:
print(df1.index)
print(df1.columns)
df1.values

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')
Index(['Name', 'Year', 'Priority', 'Watched'], dtype='object')

array([['The Avengers', 2011, 'Fourth', 'Y'],
       ['Avengers:Age of Ultron', 2014, 'Fifth', 'Y'],
       ['Avengers:Infinity War', 2017, 'Second', 'Y'],
       ['Thor Ragnarok', 2019, 'First', 'Y'],
       ['Avengers Endgame', 2020, 'Sixth', 'N'],
       ['Black Widow', 2018, 'Third', 'Not Released']], dtype=object)

In [38]:
#see statistical data of dataframe
df1.describe()

              Year
count     6.000000
mean   2016.500000
std       3.391165
min    2011.000000
25%    2014.750000
50%    2017.500000
75%    2018.750000
max    2020.000000

In [39]:
#transposing
df1.T

,1,2,3,4,5,6
Name,The Avengers,Avengers:Age of Ultron,Avengers:Infinity War,Thor Ragnarok,Avengers Endgame,Black Widow
Year,2011,2014,2017,2019,2020,2018
Priority,Fourth,Fifth,Second,First,Sixth,Third
Watched,Y,Y,Y,Y,N,Not Released

In [45]:
#slicing dataframe and sorting it by specific tag
df1.sort_values(by='Year')[2:5]

                    Name  Year Priority       Watched
3  Avengers:Infinity War  2017   Second             Y
6            Black Widow  2018    Third  Not Released
4          Thor Ragnarok  2019    First             Y

In [46]:
#querry dataframe by specific tags
df1[['Name','Priority']]

                     Name Priority
1            The Avengers   Fourth
2  Avengers:Age of Ultron    Fifth
3   Avengers:Infinity War   Second
4           Thor Ragnarok    First
5        Avengers Endgame    Sixth
6             Black Widow    Third

In [47]:
df1.iloc[2:5] #i location is same as slicing

                    Name  Year Priority Watched
3  Avengers:Infinity War  2017   Second       Y
4          Thor Ragnarok  2019    First       Y
5       Avengers Endgame  2020    Sixth       N

In [48]:
df2=df1.copy()
df2.isnull()

    Name   Year  Priority  Watched
1  False  False     False    False
2  False  False     False    False
3  False  False     False    False
4  False  False     False    False
5  False  False     False    False
6  False  False     False    False

In [56]:
#PROBLEM
df2.loc['6','Year']=2021
df2

                     Name  Year Priority       Watched
1            The Avengers  2011   Fourth             Y
2  Avengers:Age of Ultron  2014    Fifth             Y
3   Avengers:Infinity War  2017   Second             Y
4           Thor Ragnarok  2019    First             Y
5        Avengers Endgame  2020    Sixth             N
6             Black Widow  2018    Third  Not Released
6                     NaN  2021      NaN            NA
5                     NaN   NaN      NaN            NA

In [58]:
print(df1.mean())
df1.sum()

Year    2016.5
dtype: float64

Name        The AvengersAvengers:Age of UltronAvengers:Inf...
Year                                                    12099
Priority                     FourthFifthSecondFirstSixthThird
Watched                                     YYYYNNot Released
dtype: object

DataFrame File Operations

In [59]:
df1.to_csv('marvel.csv')

In [61]:
df_marvel=pd.read_csv('marvel.csv')
df_marvel.head(3)

   Unnamed: 0                    Name  Year Priority Watched
0           1            The Avengers  2011   Fourth       Y
1           2  Avengers:Age of Ultron  2014    Fifth       Y
2           3   Avengers:Infinity War  2017   Second       Y

In [69]:
#PROBLEM
df1.to_excel('marvel.xlsx',sheet_name='Movies')
df_marvel2=pd.read_excel('marvel.xlsx','Movies',index_col=None)
df_marvel2

   Unnamed: 0                    Name  Year Priority       Watched
0           1            The Avengers  2011   Fourth             Y
1           2  Avengers:Age of Ultron  2014    Fifth             Y
2           3   Avengers:Infinity War  2017   Second             Y
3           4           Thor Ragnarok  2019    First             Y
4           5        Avengers Endgame  2020    Sixth             N
5           6             Black Widow  2018    Third  Not Released